<!DOCTYPE html>
<html lang="en" dir="ltr">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <title>About</title>

    <my-favicons></my-favicons>

    <link rel="stylesheet" href="../components/universal.css">

    <script src='../components/favicon.js' type='text/javascript' defer></script>
    <script src='../components/header.js' type='text/javascript' defer></script>
    <script src='../components/main-controls.js' type='text/javascript' defer></script>
    <script src='../components/burger-menu-content.js' type='text/javascript' defer></script>
    <script src='../components/footer.js' type='text/javascript' defer></script>
    <script src="../components/burger_and_language.js" type="text/javascript" defer> </script>

    <script src="https://code.jquery.com/jquery-3.6.0.min.js" integrity="sha256-/xUj+3OJU5yExlq6GSYGSHk7tPXikynS7ogEvDej/m4=" crossorigin="anonymous"></script>
    <script>
      window.jQuery || document.write("<script src='../components/jquery-3.6.0.slim.min.js'><\/script>")
    </script>

  </head>

  <body>

    <my-header></my-header>

    <noscript>
      <a href="http://madshorn.dk/index.html">Home</a>
    </noscript>

    <div class="headContainer">
      <main-controls></main-controls>
      <burger-menu-content></burger-menu-content>

      <main>
        <div class="content">
          &nbsp;
        </div>
        <div class="content english" lang="en">
          <h1>Step-by-step Cookbook</h1>
          <p> <a href="kogebog.html">This cookbook</a> is currently only available in Danish. It is made for
            <a href="https://www.psychologytoday.com/gb/blog/the-elusive-brain/202004/neurodiversity-the-movement">
              neurodiverse people</a> who struggle with the level of memory and planning normally assumed
              by authors of cookbooks. This makes it ideal for children and people new to cooking too. </p>
          <p> The recipies is choosen to be both easy and delicious. The complexity is higher for the
            latter recipies in each category. The more complex recipies is so good they are worth the trouble ;-)</p>
          <p> As we have to eat less red meat in the years to come, the focus is on vegetarian/vegan recipies. </p>
          <p> As you work through the recipies you can keep track of your progress by checking the checkboxes. The
            button (End) at the bottom of each recipy empty the checkboxes and reset the accordion.</p>
          <p> The button at the upper right corner unfold the recipies. Unfold all to search for recipies
            or ingredience with your browsers Search-In-This-Page tool (ctrl+f on computers).</p>
          <p> At the bottom is some advice on how to shop and avoid stress in the kitchen. </p>
          <p> When you bake this <a href="../baking/tempmix/index.html">temperturmixer</a> can help
            you get the right temperature without a thermometer.</p>
          <br>
          <p> The cookbook can be printed from the browser. Unfold all recipies with the button in
            the upper right corner and press ctrl+p. Firefox prints each new recipy starting on a new page.
            This is practical for hanging the prints on the refridgerator with magnets. Then use a
            magnet to follow progress.</p>
          <br>
          <p> There is no tracking or cookies as far as I know :-)</p>
          <p> There is an <a href="https://unlicense.org/">&quot;unlicense&quot;</a> on the cookbook, so
            you can share and steal to your hearts content. </p>
          <p> The code is available on <a href="https://github.com/HappyDustbunny/kogebog">Github</a>
            where you can fork it or send pull requests. I will give no guarantee to use suggestions and
            I may be slow to respond :-)</p>
            <br>
            <p> <a href="kogebog.html">Back to the Step-by-step Cookbook</a> <a href="../index.html" class="goHome">Home</a></p>
        </div>

        <div class="content danish" lang="da">
          <h1>Om Trin-for-trin Kogebogen</h1>
          <p> <a href="kogebog.html">Denne kogebog</a> er lavet til
            <a href="http://www.neurodiversitet.dk">neurodiverse</a> der
            har sv&aelig;rt ved det niveau af hukommelse og planl&aelig;gning der antages ved
            almindelige kogeb&oslash;ger. Det g&oslash;r den ogs&aring; egnet for begyndere og b&oslash;rn.</p>
            <p>Opskrifterne er valgt for at v&aelig;re nemme og smage godt.
              Sv&aelig;rhedsgraden stiger nedad. De sv&aelig;reste opskrifter smager s&aring;
              godt, at de er besv&aelig;ret
              v&aelig;rd ;-)</p>
            <p>Da vi skal til at spise mindre k&oslash;d af hensyn til sundhed, klima og
              dyrevelf&aelig;rd er hovedv&aelig;gten p&aring; vegetariske opskrifter.</p>
            <p>Der er checkbokse s&aring; man kan vinge af n&aring;r en ingrediens er fundet
               frem eller tilsat.</p>
            <p>Knappen (Slut) i enden af hver opskrift fjerner de hak man har sat og klapper
               harmonikaen sammen.</p>
            <p>De fleste steder er m&aelig;ngderne angivet <em>b&aring;de</em> i ingredienslisten
               og i opskriften, s&aring; man ikke skal scrolle frem og tilbage.</p>
            <p>Knappen &oslash;verst til h&oslash;jre folder alle opskrifter ud og ind,
              s&aring; man kan s&oslash;ge p&aring; opskrifter eller ingredienser med browserens
               s&oslash;gev&aelig;rkt&oslash;j ("Find p&aring; siden", ctrl+f p&aring; en computer)</p>
            <p>Der er et afsnit med tips og tricks nederst, der kan hj&aelig;lpe med at
              mindske stress og begynderfejl.</p>
            <p>Hvis du bager kan denne <a href="../baking/tempmix/index.html">temperturmikser</a>
              hj&aelig;lpe dig med at f&aring; den rette temperatur.</p>
            <br>
            <p>Kogebogen kan printes fra browseren. Fold alle opskrifter ud f&oslash;rst med knappen i
              &oslash;verste h&oslash;jre hj&oslash;rne. Firefox printer s&aring; hver opskrift
              starter p&aring; en ny side, hvilket
              kan v&aelig;re praktisk, hvis man vil h&aelig;nge opsrkifterne op p&aring;
              k&oslash;leskabet med magnter, og
              flytte en magnet for at vis hvor langt man er kommet</p>
            <br>
            <p>Der er ingen tracking eller cookies fra min side.</p>
            <p>Kogebogen er udgivet under en <a href="https://unlicense.org/">&quot;unlicense&quot;</a>
              s&aring; alle kan bruge den som de har lyst og dele og stj&aelig;le frit.</p>
            <p>Koden ligger p&aring; <a href="https://github.com/HappyDustbunny/kogebog">Github</a> hvor den kan forkes eller du kan sende pull-requests.
              Jeg vil dog ikke garantere at jeg er hurtig til at reagere p&aring; bidrag, eller at alle forslag til opsrkifter vil komme med.</p>
              <br>
              <p> <a href="kogebog.html">Tilbage til Trin-for-Trin Kogebog</a> <a href="../index.html" class="goHome">Home</a></p>
        </div>
      </main>
    </div>

    <my-footer></my-footer>

  </body>
</html>
